{
    "sample_rate": 16000,
    "n_mels": 128,
    "patch_size": [16, 25],
    "speech_patch_dim": 256,
    "max_time_frames": 1000,
    "base_spec_size": [128, 1000],

    "codebook_size": 8192,
    "codebook_embed_dim": 32,
    "codebook_l2_norm": true,
    "codebook_show_usage": false,
    "commit_loss_beta": 0.0,
    "tau": 0.07,
    "num_codebooks": 4,
    "vq_mean": 0.0,
    "vq_std": 1.0,
    "entropy_loss_ratio": 0.01,
    "vq_loss_ratio": 0.0,
    "kl_loss_weight": 0.0,
    "encoder_ch_mult": [1, 1, 2, 2, 4],
    "decoder_ch_mult": [1, 1, 2, 2, 4],
    "z_channels": 256,
    "dropout_p": 0.0,
    "encoder_model": "vit_small_patch14_dinov2.lvd142m",
    "decoder_model": "vit_small_patch14_dinov2.lvd142m",

    "num_latent_tokens": 256,
    "enc_patch_size": [16, 16],
    "dec_patch_size": [16, 16],
    "enc_drop_path_rate": 0.0,
    "dec_drop_path_rate": 0.0,
    "to_audio": "linear",
    "enc_tuning_method": "full",
    "dec_tuning_method": "full",
    "enc_pretrained": true,
    "dec_pretrained": false,
    "patch_freq": 16,
    "patch_time": 25,
    "spec_size": [128, 1000],

    "use_ape": true,
    "use_rope": false,
    "rope_mixed": false,
    "rope_theta": 10.0,
    "repa": false,
    "repa_patch_size": [16, 16],
    "repa_model": "vit_base_patch16_224",
    "repa_proj_dim": 2048,
    "repa_loss_weight": 1.0,
    "repa_align": "global",

    "enc_token_drop": 0.0,
    "enc_token_drop_max": 0.6,
    
    "aux_dec_model": "vit_tiny_patch14_dinov2_movq",
    "aux_loss_mask": false,
    "aux_dec_cls_token": true,
    "aux_hog_dec": true,
    "aux_dino_dec": true,
    "aux_supcls_dec": true,
    "aux_clip_dec": true,
    "model_type": "softvq",
    "transformers_version": "4.41.0"  
  }
  